PANDAS FOR DATA ANALYSIS

In [2]:
#Importing the necessary Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#Pandas Data Structures(Series & DataFrame
#Series and DataFrames are two workhose data structures in pandas
##SERIES is one-dimensional array-like object which contains values and an array of  labels associated with those values.They can be indexed using those labels.
#Series are just like numpy arrays actually, they are built on top of numpy arrays. They can be created from a list, a dictionary or a an array.
#They are created using pd.Series command.

In [4]:
#SERIES USING LISTS
My_list=[1,2,3,4,5]
My_list
My_Series=pd.Series(My_list)
My_Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#We can also create our own labels
My_Label=['a','b','c','d','e']
My_Series2=pd.Series(My_list,index=My_Label)
My_Series2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
#GRABBING DATA FROM A SERIES
##Indexes are the key things to understand from a series.Pandas uses these indexes for fast information retrieval.
#Lets create 3 series from dictionaries for demosntration of the above concept.
DICT1={'Toronto':500,'Calgary':200,'Vancouver':300,'Montreal':700}
DICT2={'Calgary':200,'Vancouver':300,'Montreal':700}
DICT3={'Calgary':200,'Vancouver':300,'Montreal':700}

In [7]:
SER1=pd.Series(DICT1)
SER2=pd.Series(DICT2)
SER3=pd.Series(DICT3)

In [8]:
SER1

Toronto      500
Calgary      200
Vancouver    300
Montreal     700
dtype: int64

In [9]:
SER2

Calgary      200
Vancouver    300
Montreal     700
dtype: int64

In [10]:
SER3

Calgary      200
Vancouver    300
Montreal     700
dtype: int64

In [12]:
#GRABBING INFORMATION FROM A SERIES
SER1['Calgary']

200

In [13]:
SER2['Vancouver']

300

In [14]:
SER3['Montreal']

700

In [15]:
#Basic operations on series are usually based on indexes, if for example we try adding SER1 + SER 2, CALGARY ON SERIES 1 WILL BE ADDED TO CALGARY ON SERIES 2.Where there is no match an NaN will be returned
SER4=SER1+SER2
SER4

Calgary       400.0
Montreal     1400.0
Toronto         NaN
Vancouver     600.0
dtype: float64

In [16]:
SER5=SER4+SER3
SER5

Calgary       600.0
Montreal     2100.0
Toronto         NaN
Vancouver     900.0
dtype: float64

In [17]:
#BUILT IN FUNCTIONS AND ATTRIBUTES IN SERIES DURING DATA PREPROCESSING
#1)isnull()-Used in detecting missing data
#2)notnull()-Detects exsistingor non missing values
#3)head(),tail()-To extract a small sample of the data.Default is 5
#4) axes-returns a series of the row axis labels
#5)values-returns list of values/data
#6)size-returns the number of elements in the series
#7)empty-returns true if the series is empty

In [18]:
SER1.isnull()

Toronto      False
Calgary      False
Vancouver    False
Montreal     False
dtype: bool

In [19]:
SER1.notnull()

Toronto      True
Calgary      True
Vancouver    True
Montreal     True
dtype: bool

In [20]:
SER1.axes

[Index(['Toronto', 'Calgary', 'Vancouver', 'Montreal'], dtype='object')]

In [22]:
SER1.size

4

In [23]:
SER1.head(2)

Toronto    500
Calgary    200
dtype: int64

In [24]:
SER1.tail(2)

Vancouver    300
Montreal     700
dtype: int64

In [25]:
SER1.empty

False

In [26]:
SER1.values

array([500, 200, 300, 700], dtype=int64)

In [27]:
##DATAFRAMES-Dataframes are simply a bunch of series sharing a same index
##A dataframe is a rectangular table of data containing an ordered collection of columns each of which can be a different type of data.
##A dataframe has both row and column index.Can be thought as a dictionary of series all sharing the same index.

In [28]:
#CREATING A DATAFRAME FOR EASY LEARNING

In [31]:
#First we gonna create 2 indexes, one for row 1 to row 10 and theother for column 1 to column 10
index='r1 r2 r3 r4 r5 r6 r7 r8 r9 r10'.split()
column='c1 c2 c3 c4 c5 c6 c7 c8 c9 c10'.split()

In [32]:
index

['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7', 'r8', 'r9', 'r10']

In [33]:
column

['c1', 'c2', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10']

In [37]:
#We then create a matrix using one of the array methods,
ARRAY=np.arange(0,100).reshape(10,10)
ARRAY

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [38]:
DATAFRAME=pd.DataFrame(ARRAY,index,column)
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [41]:
#GRABBING COLUMNS FROM A DATAFRAME
DATAFRAME['c1']

r1      0
r2     10
r3     20
r4     30
r5     40
r6     50
r7     60
r8     70
r9     80
r10    90
Name: c1, dtype: int32

In [43]:
DATAFRAME[['c1','c2','c3']]

     c1  c2  c3
r1    0   1   2
r2   10  11  12
r3   20  21  22
r4   30  31  32
r5   40  41  42
r6   50  51  52
r7   60  61  62
r8   70  71  72
r9   80  81  82
r10  90  91  92

In [60]:
#ADDING A NEW COLUMN TO A DATAFRAME
DATAFRAME['new']=DATAFRAME['c1']+DATAFRAME['c2']
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  new
r1    0   1   2   3   4   5   6   7   8    9    1
r2   10  11  12  13  14  15  16  17  18   19   21
r3   20  21  22  23  24  25  26  27  28   29   41
r4   30  31  32  33  34  35  36  37  38   39   61
r5   40  41  42  43  44  45  46  47  48   49   81
r6   50  51  52  53  54  55  56  57  58   59  101
r7   60  61  62  63  64  65  66  67  68   69  121
r8   70  71  72  73  74  75  76  77  78   79  141
r9   80  81  82  83  84  85  86  87  88   89  161
r10  90  91  92  93  94  95  96  97  98   99  181

In [66]:
DATAFRAME['neww']=DATAFRAME['c1']*DATAFRAME['c3']
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  new  neww
r1    0   1   2   3   4   5   6   7   8    9    1     0
r2   10  11  12  13  14  15  16  17  18   19   21   120
r3   20  21  22  23  24  25  26  27  28   29   41   440
r4   30  31  32  33  34  35  36  37  38   39   61   960
r5   40  41  42  43  44  45  46  47  48   49   81  1680
r6   50  51  52  53  54  55  56  57  58   59  101  2600
r7   60  61  62  63  64  65  66  67  68   69  121  3720
r8   70  71  72  73  74  75  76  77  78   79  141  5040
r9   80  81  82  83  84  85  86  87  88   89  161  6560
r10  90  91  92  93  94  95  96  97  98   99  181  8280

In [39]:
#DELETING A COLUMN FROM A DATAFRAME
#We use drop() to delete a column from a dataframe.W need to specify the axis and also use inplace to make sure we dont delete by mistake.
#axis=0 refers to a row whereas axis=1 refers to a column.
#inplace=True ensures that we delete permeanently. By default, inplace =False

In [62]:
#Quick checks
DATAFRAME.shape

(10, 12)

In [63]:
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  new  neww
r1    0   1   2   3   4   5   6   7   8    9    1     0
r2   10  11  12  13  14  15  16  17  18   19   21   120
r3   20  21  22  23  24  25  26  27  28   29   41   440
r4   30  31  32  33  34  35  36  37  38   39   61   960
r5   40  41  42  43  44  45  46  47  48   49   81  1680
r6   50  51  52  53  54  55  56  57  58   59  101  2600
r7   60  61  62  63  64  65  66  67  68   69  121  3720
r8   70  71  72  73  74  75  76  77  78   79  141  5040
r9   80  81  82  83  84  85  86  87  88   89  161  6560
r10  90  91  92  93  94  95  96  97  98   99  181  8280

In [67]:
DATAFRAME.drop(['neww'], axis=1,inplace=True)

In [68]:
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  new
r1    0   1   2   3   4   5   6   7   8    9    1
r2   10  11  12  13  14  15  16  17  18   19   21
r3   20  21  22  23  24  25  26  27  28   29   41
r4   30  31  32  33  34  35  36  37  38   39   61
r5   40  41  42  43  44  45  46  47  48   49   81
r6   50  51  52  53  54  55  56  57  58   59  101
r7   60  61  62  63  64  65  66  67  68   69  121
r8   70  71  72  73  74  75  76  77  78   79  141
r9   80  81  82  83  84  85  86  87  88   89  161
r10  90  91  92  93  94  95  96  97  98   99  181

In [73]:
DATAFRAME.drop(['c10','new'],axis=1,inplace=True)

In [74]:
DATAFRAME

     c1  c2  c3  c4  c5  c6  c7  c8  c9
r1    0   1   2   3   4   5   6   7   8
r2   10  11  12  13  14  15  16  17  18
r3   20  21  22  23  24  25  26  27  28
r4   30  31  32  33  34  35  36  37  38
r5   40  41  42  43  44  45  46  47  48
r6   50  51  52  53  54  55  56  57  58
r7   60  61  62  63  64  65  66  67  68
r8   70  71  72  73  74  75  76  77  78
r9   80  81  82  83  84  85  86  87  88
r10  90  91  92  93  94  95  96  97  98

In [75]:
#Grabbing rows from a dataframe
#We grab or retrieve rows using itra name or position with loc and iloc.loc accesses rows by their names whereas iloc acceses rows by their position

In [76]:
DATAFRAME.loc['r1']

c1    0
c2    1
c3    2
c4    3
c5    4
c6    5
c7    6
c8    7
c9    8
Name: r1, dtype: int32

In [79]:
DATAFRAME.loc[['r1','r2']]

    c1  c2  c3  c4  c5  c6  c7  c8  c9
r1   0   1   2   3   4   5   6   7   8
r2  10  11  12  13  14  15  16  17  18

In [80]:
DATAFRAME.iloc[1]

c1    10
c2    11
c3    12
c4    13
c5    14
c6    15
c7    16
c8    17
c9    18
Name: r2, dtype: int32

In [81]:
DATAFRAME.iloc[[1,2,3]]

    c1  c2  c3  c4  c5  c6  c7  c8  c9
r2  10  11  12  13  14  15  16  17  18
r3  20  21  22  23  24  25  26  27  28
r4  30  31  32  33  34  35  36  37  38

In [82]:
#GRABBING A SINGLE ELEMENT FROM A DATAFRAME.
#To do this, we need to specify the [row,col]

In [84]:
DATAFRAME.loc['r1','c1']

0

In [85]:
DATAFRAME.loc['r1','c9']

8

In [86]:
DATAFRAME.loc[['r1','r2','r3'],['c1','c2','c3']]

    c1  c2  c3
r1   0   1   2
r2  10  11  12
r3  20  21  22

In [87]:
#Conditional selection or Masking

In [88]:
DATAFRAME<3

        c1     c2     c3     c4     c5     c6     c7     c8     c9
r1    True   True   True  False  False  False  False  False  False
r2   False  False  False  False  False  False  False  False  False
r3   False  False  False  False  False  False  False  False  False
r4   False  False  False  False  False  False  False  False  False
r5   False  False  False  False  False  False  False  False  False
r6   False  False  False  False  False  False  False  False  False
r7   False  False  False  False  False  False  False  False  False
r8   False  False  False  False  False  False  False  False  False
r9   False  False  False  False  False  False  False  False  False
r10  False  False  False  False  False  False  False  False  False

In [89]:
DATAFRAME>7

        c1     c2     c3     c4     c5     c6     c7     c8    c9
r1   False  False  False  False  False  False  False  False  True
r2    True   True   True   True   True   True   True   True  True
r3    True   True   True   True   True   True   True   True  True
r4    True   True   True   True   True   True   True   True  True
r5    True   True   True   True   True   True   True   True  True
r6    True   True   True   True   True   True   True   True  True
r7    True   True   True   True   True   True   True   True  True
r8    True   True   True   True   True   True   True   True  True
r9    True   True   True   True   True   True   True   True  True
r10   True   True   True   True   True   True   True   True  True

In [90]:
#Exploring the dataframe
DATAFRAME.head()

    c1  c2  c3  c4  c5  c6  c7  c8  c9
r1   0   1   2   3   4   5   6   7   8
r2  10  11  12  13  14  15  16  17  18
r3  20  21  22  23  24  25  26  27  28
r4  30  31  32  33  34  35  36  37  38
r5  40  41  42  43  44  45  46  47  48

In [91]:
DATAFRAME.head(3)

    c1  c2  c3  c4  c5  c6  c7  c8  c9
r1   0   1   2   3   4   5   6   7   8
r2  10  11  12  13  14  15  16  17  18
r3  20  21  22  23  24  25  26  27  28

In [92]:
DATAFRAME.tail()

     c1  c2  c3  c4  c5  c6  c7  c8  c9
r6   50  51  52  53  54  55  56  57  58
r7   60  61  62  63  64  65  66  67  68
r8   70  71  72  73  74  75  76  77  78
r9   80  81  82  83  84  85  86  87  88
r10  90  91  92  93  94  95  96  97  98

In [93]:
DATAFRAME.tail(3)

     c1  c2  c3  c4  c5  c6  c7  c8  c9
r8   70  71  72  73  74  75  76  77  78
r9   80  81  82  83  84  85  86  87  88
r10  90  91  92  93  94  95  96  97  98

In [94]:
#We use info() function when we want to check the concise summary of the dataframe

In [95]:
DATAFRAME.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, r1 to r10
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      10 non-null     int32
 1   c2      10 non-null     int32
 2   c3      10 non-null     int32
 3   c4      10 non-null     int32
 4   c5      10 non-null     int32
 5   c6      10 non-null     int32
 6   c7      10 non-null     int32
 7   c8      10 non-null     int32
 8   c9      10 non-null     int32
dtypes: int32(9)
memory usage: 740.0+ bytes

In [96]:
#We use describe() to generate a descriptive statistics of the dataframe

In [100]:
DATAFRAME.describe()

,c1,c2,c3,c4,c5,c6,c7,c8,c9
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000
std,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504
min,0.000000,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000
25%,22.500000,23.500000,24.500000,25.500000,26.500000,27.500000,28.500000,29.500000,30.500000
50%,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000
75%,67.500000,68.500000,69.500000,70.500000,71.500000,72.500000,73.500000,74.500000,75.500000
max,90.000000,91.000000,92.000000,93.000000,94.000000,95.000000,96.000000,97.000000,98.000000

In [101]:
#Handling Missing Data
##Missing data is very common in many data science applications and pandas has a great ability to handle this situation.
##The missing data is mostly reffered to as NA or NaN
##Lets create a dataframe with missing data.We can use numpy's functionality for adding missing data

In [103]:
DATA_DICT={'A':[1,2,np.nan,4,np.nan],'B':[np.nan,np.nan,np.nan,np.nan,np.nan],'C':[11,12,13,14,15],'D':[16,np.nan,18,19,20]}      
DATA_DICT

{'A': [1, 2, nan, 4, nan],
 'B': [nan, nan, nan, nan, nan],
 'C': [11, 12, 13, 14, 15],
 'D': [16, nan, 18, 19, 20]}

In [104]:
DATAFRAMEE=pd.DataFrame(DATA_DICT)
DATAFRAMEE

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [105]:
##isnull() and notnull() are useful methods to check missing data in a dataset

In [106]:
DATAFRAMEE.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [108]:
DATAFRAMEE.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [111]:
DATAFRAMEE.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [112]:
#Note that for sum(), pandas considers NaN as zero

In [113]:
DATAFRAMEE['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [114]:
DATAFRAMEE['A'].isnull().sum()

2

In [115]:
DATAFRAMEE['A'].notnull()

0     True
1     True
2    False
3     True
4    False
Name: A, dtype: bool

In [116]:
DATAFRAMEE['A'].notnull().sum()

3

In [117]:
DATAFRAMEE['C'].notnull()

0    True
1    True
2    True
3    True
4    True
Name: C, dtype: bool

In [119]:
DATAFRAMEE['A'].notnull().sum()

3

In [120]:
##When computing means ,NaN is ignored

In [121]:
DATAFRAMEE['A'].notnull().mean()

0.6

In [122]:
##dropna() and fillna() are useful methods to clean and fill the missing data
##dropna() will drop any row that has NaN in it. This is because its default axis=0. You can however drop a column by changing the axis =1
##We can also include a thresh parameter in the function for example if we say thresh=3, the function will drop drop any column that has NaN less than 3 .

In [123]:
DATAFRAMEE.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

In [124]:
##We can use fill.na() to fill in the NaN values.Inplaced=True for permanent change

In [125]:
DATAFRAMEE.fillna(value='Filled')

        A       B   C       D
0     1.0  Filled  11    16.0
1     2.0  Filled  12  Filled
2  Filled  Filled  13    18.0
3     4.0  Filled  14    19.0
4  Filled  Filled  15    20.0

In [128]:
DATAFRAMEE.fillna(value=DATAFRAMEE['A'].mean())

          A         B   C          D
0  1.000000  2.333333  11  16.000000
1  2.000000  2.333333  12   2.333333
2  2.333333  2.333333  13  18.000000
3  4.000000  2.333333  14  19.000000
4  2.333333  2.333333  15  20.000000

In [129]:
DATAFRAMEE.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [130]:
DATAFRAMEE.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [131]:
DATAFRAMEE.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [132]:
#MERGING AND CONCATENATING DATAFRAMES.
##merge() is used when wewant to join datasets by linking rows using one or more keys.
#The merge function has two important parameters together with other many parameters.
##The two parameters are 'how' and 'on'.
#'how' specifies thetype of merge to be perfomed either 'inner','outer','left','right'.
##The 'inner' is similar to SQL inner join and it uses intersection of keys from both datasets.
##The 'outer' is similar to SQL full outer join and it uses union of keys from both frames.
##The 'left' is similar to SQL left outer join and it uses only keys from the left frame.
##The 'right' is similar to SQL right outer join and it uses only keys from the right frame
###Note that on label or list, fieldnames to join on must be found in both dataframes

In [135]:
DATAFRAME1=pd.DataFrame({'key':['a','b','c','d','e'],'A1':range(5),'B1':range(5,10)})
DATAFRAME1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [136]:
DATAFRAME2=pd.DataFrame({'key':['a','b','c'],'A2':range(3),'B1':range(3,6)})
DATAFRAME2

  key  A2  B1
0   a   0   3
1   b   1   4
2   c   2   5

In [137]:
##Inner merge or join
INNER=pd.merge(DATAFRAME1,DATAFRAME2,how='inner', on='key')
INNER

  key  A1  B1_x  A2  B1_y
0   a   0     5   0     3
1   b   1     6   1     4
2   c   2     7   2     5

In [138]:
##Outer join or merge
OUTER=pd.merge(DATAFRAME1,DATAFRAME2,how='outer',on='key')
OUTER

  key  A1  B1_x   A2  B1_y
0   a   0     5  0.0   3.0
1   b   1     6  1.0   4.0
2   c   2     7  2.0   5.0
3   d   3     8  NaN   NaN
4   e   4     9  NaN   NaN

In [139]:
##left merge or join
LEFT=pd.merge(DATAFRAME1,DATAFRAME2,how='left',on='key')
LEFT

  key  A1  B1_x   A2  B1_y
0   a   0     5  0.0   3.0
1   b   1     6  1.0   4.0
2   c   2     7  2.0   5.0
3   d   3     8  NaN   NaN
4   e   4     9  NaN   NaN

In [140]:
##Right merge or join
RIGHT=pd.merge(DATAFRAME1,DATAFRAME2,how='right',on='key')
RIGHT

  key  A1  B1_x  A2  B1_y
0   a   0     5   0     3
1   b   1     6   1     4
2   c   2     7   2     5

In [141]:
##CONCATENATION
##uses pd.concat() and is interchangeably refered as binding or stacking as well.
##The operation basically glues together dataframes.
##It is important that dimensions should match along the axis we are concatenating on

In [142]:
DATAFRAME3=pd.DataFrame({'key':['e','f','g','h','i'],'A3':range(5),'B3':range(5,10)})
DATAFRAME3

  key  A3  B3
0   e   0   5
1   f   1   6
2   g   2   7
3   h   3   8
4   i   4   9

In [143]:
pd.concat([DATAFRAME1,DATAFRAME3],axis=1)

  key  A1  B1 key  A3  B3
0   a   0   5   e   0   5
1   b   1   6   f   1   6
2   c   2   7   g   2   7
3   d   3   8   h   3   8
4   e   4   9   i   4   9

In [144]:
pd.concat([DATAFRAME1,DATAFRAME3],axis=0)

  key   A1   B1   A3   B3
0   a  0.0  5.0  NaN  NaN
1   b  1.0  6.0  NaN  NaN
2   c  2.0  7.0  NaN  NaN
3   d  3.0  8.0  NaN  NaN
4   e  4.0  9.0  NaN  NaN
0   e  NaN  NaN  0.0  5.0
1   f  NaN  NaN  1.0  6.0
2   g  NaN  NaN  2.0  7.0
3   h  NaN  NaN  3.0  8.0
4   i  NaN  NaN  4.0  9.0

In [145]:
##Groupby--This is one of the most important functionionality in pandas.It allows us to group data together, call aggregate functions and combine the resuts in three steps which are split-apply-combine.
##split= in this process, data in pandas object is split into groups depending on one or more keys provides and can be row or column that is axis=0 or axis=1
##apply=Once splitting is done, a function is applied to all groups independently, producing a new value.
##combine=Finally the result of the function are combined into a resultant object

In [147]:
##Lets ceate a dictionary and convert into a pandas dataframe then try using groupby in the dataframe
DATAAA={'store':['Walmart','Walmart','Costco','Costco','Target','Target'],'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],'Sales':[150,200,550,90,430,120]}
DATAFR=pd.DataFrame(DATAAA)
DATAFR

     store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [149]:
##Lets group the DATAFR by store
DATAFR.groupby('store')

In [150]:
##Lets save the object in a variable
DG=DATAFR.groupby('store')
DG

In [151]:
##Now since we have grouped the dataframe by store, we can call in an aggregate method in the object
DG.sum()

C:\Users\Dell\AppData\Local\Temp\ipykernel_27692\720196220.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DG.sum()

         Sales
store
Costco     640
Target     550
Walmart    350

In [153]:
DATAFR.groupby('Customer').mean()

C:\Users\Dell\AppData\Local\Temp\ipykernel_27692\2487560982.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DATAFR.groupby('Customer').mean()

          Sales
Customer
Denice     90.0
Jermy     200.0
Mark      550.0
Ray       430.0
Sam       120.0
Tim       150.0

In [155]:
DATAFR.groupby('store').mean()

C:\Users\Dell\AppData\Local\Temp\ipykernel_27692\2893339959.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DATAFR.groupby('store').mean()

         Sales
store
Costco   320.0
Target   275.0
Walmart  175.0

In [156]:
DATAFR.groupby('store').min()

        Customer  Sales
store
Costco    Denice     90
Target       Ray    120
Walmart    Jermy    150

In [157]:
DATAFR.groupby('store').max()

        Customer  Sales
store
Costco      Mark    550
Target       Sam    430
Walmart      Tim    200

In [158]:
DATAFR.groupby('store').std()

C:\Users\Dell\AppData\Local\Temp\ipykernel_27692\3954946748.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DATAFR.groupby('store').std()

              Sales
store
Costco   325.269119
Target   219.203102
Walmart   35.355339

In [159]:
DATAFR.groupby('store').count()

         Customer  Sales
store
Costco          2      2
Target          2      2
Walmart         2      2

In [160]:
DATAFR.groupby('store').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

In [161]:
DATAFR.groupby('Customer').describe()

         Sales
         count   mean std    min    25%    50%    75%    max
Customer
Denice     1.0   90.0 NaN   90.0   90.0   90.0   90.0   90.0
Jermy      1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Mark       1.0  550.0 NaN  550.0  550.0  550.0  550.0  550.0
Ray        1.0  430.0 NaN  430.0  430.0  430.0  430.0  430.0
Sam        1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Tim        1.0  150.0 NaN  150.0  150.0  150.0  150.0  150.0

In [162]:
DATAFR.groupby('store').describe().transpose()

store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000

In [163]:
###USEFUL METHODS WHEN MANIPULATING DATA WITH PANDAS
#info()--it is a function used when we need a concise summary of a dataframe
#head(n)--it is a function used when we want to extract the first few observations of the data
#isnull()--it is a function used when we need to check if we have Nullor NA or NaN values in a data
#dropna()--It is a useful function used during datacleaning to get rid of the NA values
#fillna()--It is also a useful function in datacleaning ecspecially when replacing the Null values
#Unique()--This is a function used when when we want to return unique values only in a dataframe
#nunique()--This is a function used when we want to know how many unique values exist in a dataframe
#value_counts()--This is a function used when we want a table with all the values along with the number of times they appear in a dataset
#sort_values()--This function is used when we want to sot values. default is ascending